#include<cstdio>
#define å int
#define ä scanf
#define à if
#define á else
#define â for
#define è while
#define ê break
#define ë "%d"
#define ĕ (
void é(å &Â){Â=Â==0?1:0;}
å main(){
    å Ã[101]={},Å,Ä,À,Á;
    ä(ë,&Å);
    â(å Â=1;Â<=Å;Â++)ä(ë,&Ã[Â]);
    ä(ë,&Ä);
    è(Ä--){
        ä("%d %d",&À,&Á);
        à(À==1)â(å Â=Á;Â<=Å;Â+=Á)é(Ã[Â]);
        á{é(Ã[Á]);â(å Â=1;(Á-Â>=1)&&(Á+Â<=Å);Â++){à(Ã[Á-Â]==Ã[Á+Â]){é(Ã[Á-Â]);é(Ã[Á+Â]);}á ê;}}
    }
    â(å Â=1;Â<=Å;Â++)printf("%d%c",Ã[Â],Â%20?' ':'\n');
}